<?php
    print("Введите число: ");
    $n = intval(fgets(STDIN));
    $m = $n;  // Начальное значение "корня" числа
    while ($m > 9)  // Внешний цикл: повторять пока число не станет однозначным
    {
        $s = 0;  // Сумма цифр введённого числа
        while ($m > 0)  // Внутренний цикл: повторять пока число больше нуля
        {
            $s = $s + $m % 10;  // Вычислить сумму цифр числа.
            $m = intdiv($m, 10); // Число уменьшить в 10 раз.
        }   
        $m = $s;  // Промежуточное значение "корня" числа
    }    
    // Вывод на экран исходного числа и его "корня"
    print("\"Корень\" числа " . $n . " - " . $m . "\r\n");
?>